# KipPerIn Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..KipPerIn Property
SymbolTypeId Class See Also
---
Symbol kip/in, indicating unit Kips per inch.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId KipPerIn { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property KipPerIn As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ KipPerIn {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace